app/controllers/clients_controller.rb

SELECT  "clients".* FROM "clients"  ORDER BY vrazon2 ASC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "clients"
---
  def index



    if params[:search]
      @clients = Client.search(params[:search]).order("vrazon2 ASC").page(params[:page]).per_page(15)