app/controllers/invoices_controller.rb

	def import
       Invoice.delete_all
---
DELETE FROM "invoices"

    def show
    	@invoice        = Invoice.find(params[:id])
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", 868]]