app/controllers/mailings_controller.rb

  def index
    @mailings = Mailing.all.order("numero")
---
SELECT "mailings".* FROM "mailings"  ORDER BY numero